app/Controllers/Inicio.php

DELETE FROM `alumnos`
WHERE `id` IN ('23')
---
    public function delete($id)
    {
        $model = new AlumnosModel();
        $model->delete($id);