app/Models/AlumnosModel.php

SELECT *
FROM `alumnos`
---
    public function getAlumnos()
    {
        return $this->findAll();

INSERT INTO `alumnos` (`nombre`, `apellido`, `telefono`) VALUES ('lol', 'lol', '12345')
---
    public function add($dato)
    {
        return $this->save($dato);

SELECT *
FROM `alumnos`
WHERE `id` = '24'
 LIMIT 1
---
    public function getAlumno($id)
    {
        return $this->where('id', $id)->first($id);

UPDATE `alumnos` SET `id` = '24', `nombre` = 'lola', `apellido` = 'lola', `telefono` = '12345'
WHERE `alumnos`.`id` IN ('24')
---
    public function updateDatos($id, $datos)
    {
        return $this->update($id, $datos);